vodka_end = 'А паспорт-то у тебя есть? Ладно уж...\nИнструкция к применению: Откройте бутылку и подлейте водки в ' \
            'стакан сока выбранного вами игрока. Не забудьте сделать вид, что это не вы. '
ropes_end = 'Спасибо за покупку!\nИнструкция к применению: Свяжите выбранного вами человека. При неправильной ' \
            'эксплуатации обратитесь к специалисту. Не забудьте сделать вид, что это не вы. '
jour_end = 'Спасибо за покупку!\nИнструкция к применению: Выберите двух игроков, стороны которых желаете проверить, ' \
           'и назовите их имена по номеру телефона. Не забудьте сделать вид, что это не вы. '
bug_end = 'Спасибо за покупку!\nИнструкция к применению: Оставьте устройство в незаметном месте. Помните, ' \
          'что предварительно нужно вставить в него батарейки. Не забудьте сделать вид, что это не вы. '
curse_end = 'Спасибо за покупку!\nИнструкция к применению: Убедитесь, что правильно назвали имя, иначе можете ' \
            'испортить жизнь ни в чём неповинному человеку. В любом случае не забудьте сделать вид, что это не вы. '
pure_end = 'Спасибо за покупку!\nИнструкция к применению: Наденьте на шею себе или выбранному вами игроку. Не снимайте.'
afer_end = 'Спасибо за покупку!\nИнструкция к применению: Не отдавайте компромат в руки выбранному игроку и ' \
           'запаситесь угрожающими фразами. Не забудьте сделать вид, что это не вы. '
truth_end = 'Спасибо за покупку!\nИнструкция к применению: Подлейте интересующему вас игроку и отойдите. Он сам вам ' \
            'всё расскажет и даже не вспомнит об этом. Не забудьте сделать вид, что это не вы. '
kill_end = 'Спасибо за покупку!\nИнструкция к применению: Когда вам придёт уведомление о проверке, сделайте звонок ' \
           'Роберто, и о вашем проверяющем позаботятся. Не забудьте сделать вид, что это не вы. '
voodoo_end = 'Спасибо за покупку!\nИнструкция: Положите на Куклу Вуду волос выбранного вами игрока. Потыкайте её ' \
             'иголочкой. Ждите. Не забудьте сделать вид, что это не вы. '

vodka1 = '➤Предмет: Бутылка водки\nФаза активации: ночная\nОписание: Только в Лавке Роберто вам доступна легендарная ' \
         'бутылка русской водки из запасов сеньорины Нат! Купите её, и вы гарантированно обезвредите своего врага на ' \
         'следующие несколько часов.\nДополнительно: Активируется только на другого человека в ночную фазу. На ' \
         'следующий день выбранный игрок не сможет голосовать, а также общаться в игровых беседах и альянсах. Если у ' \
         'выбранного игрока активная дневная роль, он также не сможет совершить свой ход. '
ropes1 = '➤Предмет: Бондаж\nФаза активации: любая\nОписание: С эксклюзивным набором БДСМ-снаряжения выбранный вами ' \
         'человек и пошевелить пальцем не сможет! Удовольствие гарантировано!\nДополнительно: Активируется в любую ' \
         'фазу, но только на другого игрока. После активации на игрока он не сможет совершить каких-либо активных ' \
         'действий, в том числе и использовать контракт или предмет. Не распространяется на действия, совершённые ДО ' \
         'применения. Не лишает выбранного игрока права голоса, если активирован ночью. В случае активации в дневную ' \
         'фазу выбранный игрок лишается права голоса.\nО том, что игрока заблокировали бондажом, ему сообщается, ' \
         'как только обрабатывается заявка. '
jour1 = '➤Предмет: Заказная статья\nФаза активации: дневная\nОписание: Не всем дано быть Журналистом. Но не ' \
        'отчаивайтесь: с этим вам может помочь Заказная статья из Лавки Роберто! Всего один звоночек – и о тех, ' \
        'кто вам интересен, будут говорить все газеты города.\nДополнительно: Активируется в дневную фазу (до 16:00) ' \
        'на любых игроков, кроме себя и тех, кто уже был упомянут в основных статьях журналиста. '
bug1 = '➤Предмет: Прослушка\nФаза активации: любая\nОписание: Высокотехнологичное устройство поможет вам не только ' \
       'узнать то, что скрывается за закрытыми дверьми, но и остаться незаметными для врагов! Среди дефектов: краткая ' \
       'продолжительность работы батареек.\nДополнительно: Ввиду краткой продолжительно работы вам сообщается только ' \
       'первое действие, совершённое игроком за фазу, будь оно действием роли, контракта или предмета. Активируется в ' \
       'текущую фазу, результат приходит после её окончания, но до итогов (день – после 16:00, ночь – после 22:00). ' \
       'Игроку о проверке не сообщается. '
curse1 = '➤Предмет: Порча\nФаза активации: любая\nОписание: Вам кто-то перешёл дорогу, но марать руки о него не ' \
         'хочется? Этому есть решение! По выгодной цене специалисты из Лавки Роберто наведут порчу на неугодного вам ' \
         'игрока, и жизнь ему будет несладка.\nДополнительно: Проклятый игрок умирает вместе с Ведьмой. О проклятии ' \
         'игроку не сообщается. '
pure1 = '➤Предмет: Амулет\nФаза активации: любая\nОписание: Боитесь, что городская Ведьма положит на вас свой ' \
        'коварный глаз? С Амулетом из Лавки Роберто она перестанет быть для вас угрозой! Купите сейчас, и вы будете ' \
        'защищены от любого сглаза до конца своих дней.\nДополнительно: Игрок наделяется иммунитетом как от уже ' \
        'наложенного проклятия, так и от возможности быть проклятым. '
afer1 = '➤Предмет: Компромат\nФаза активации: ночная\nОписание: Какую информацию только ни могут нарыть люди, ' \
        'которые знают, где искать. Так вот имейте в виду: мы знаем! Обратитесь в Лавку Роберто, и мы найдём столько ' \
        'грязи на вашего человечка, что ему просто придётся действовать по вашей указке.\nДополнительно: Выбирается ' \
        'два игрока — тот, который будет голосовать, и тот, против кого будут голосовать в следующую дневную фазу. ' \
        'Жертва не имеет права говорить остальным игрокам о том, что она попала под влияние предмета. '
truth1 = '➤Предмет: Сыворотка правды\nФаза активации: любая\nОписание: Магическое зелье только из отборных трав, ' \
         'под воздействием которого невозможно соврать! Хотите проверить подозрительного человека? Не доверяете ' \
         'своему союзнику? Тогда это то, что вам нужно! С помощью него вы сможете узнать, на какой стороне играет ' \
         'выбранный вами человек.\nДополнительно: Активируется в текущую фазу, результат приходит после окончания ' \
         'фазы, но до итогов (днём – после 16:00, ночью – после 22:00). О проверке игроку не сообщается. '
kill1 = '➤Предмет: Звонок киллеру\nФаза активации: любая\nОписание: У вас аллергия на проверки? Лавка Роберто ' \
        'подобрала для вас простое и гениальное решение: убейте того, кто проверяет! Результат вас приятно ' \
        'удивит!\nДополнительно: Активируется только при наличии проверки. В результате использования предмета ваша ' \
        'сторона/роль остаётся в секрете, а проверяющий вас игрок умирает, контракты Лечения и Иммунитета против ' \
        'этого предмета не действуют. Может быть использовано на другого игрока. '
voodoo1 = '➤Предмет: Кукла Вуду\nФаза активации: ночная\nОписание: Настоящий эксклюзив и лучший способ спутать ' \
          'противнику карты! С помощью Куклы Вуду вы можете перенаправить выстрел врага туда, куда только вам ' \
          'выгодно.\nДополнительно: Если игрок, использующий предмет, светлый или серый, он крадёт выстрел у мафии и ' \
          'направляет его в любого игрока по своему выбору, т.е. мафия выстрел не совершает. Если игрок, использующий ' \
          'предмет, тёмный, он крадёт выстрел у Маньяка и направляет его в любого игрока по своему выбору, ' \
          'т.е. Маньяк выстрел не совершает. Предмет можно активировать только с 18:00 до 19:00.\nЕсли обладатель ' \
          'Куклы Вуды убивает Мстителя, он умирает вместе с Мстителем. '

import vk_api
from vk_api.longpoll import VkLongPoll, VkEventType
from vk_api.utils import get_random_id
from vk_api import VkUpload
from vk_api.keyboard import VkKeyboard, VkKeyboardColor
import datetime


def send_message(sender, message):
    authorize.method('messages.send', {'user_id': sender, 'message': message, 'random_id': get_random_id()})


def send_button(sender, message):
    authorize.method('messages.send', {'user_id': sender, 'message': message, 'random_id': get_random_id(),
                                       'keyboard': keyboard.get_keyboard()})


def send_sticker(sender, sticker):
    authorize.method('messages.send', {'user_id': sender, 'sticker_id': sticker, 'random_id': get_random_id()})


def get_name(sayer_id):
    sender_info = getting_api.users.get(user_ids=sayer_id)[0]
    full_name = sender_info.get('first_name') + ' ' + sender_info['last_name']
    return full_name


def find_ending(num):
    num = int(num)
    ending = 'ов'
    if num % 10 == 1:
        ending = ''
    elif num % 10 == 2 or num % 10 == 3 or num % 10 == 4:
        ending = 'а'
    return ending


def get_bal(sender_):
    global shop
    sender_ = int(sender_)
    for s in range(len(shop)):
        if shop[s - 1]['sender'] == sender_:
            balance1 = shop[s - 1]['balance']
    return int(balance1)


def get_balance(sender_):
    sender_ = int(sender_)
    player_balance = f'баланс: {get_bal(sender_)} деллик{find_ending(get_bal(sender_))}.'
    return player_balance


def buying(sender, item_end):
    shop[i - 1]['balance'] -= 30
    shop[i - 1]['items'] = 1
    player_balance = get_balance(sender)
    complete = item_end + f'\n\nТекущий {player_balance}'
    return complete


vodka = 4
ropes = 4
jour = 4
bug = 4
curse = 2
pure = 2
afer = 3
truth = 2
kill = 2
voodoo = 1

req = []
shop = [{'sender': 313354983,
         'balance': 1000,
         'is_true_sides': 0,
         'is_true_deaths': 0,
         'items': 0,
         'side': '',
         'stav': 0},
        {'sender': 605574836,
         'balance': 1000,
         'is_true_sides': 0,
         'is_true_deaths': 0,
         'items': 0,
         'side': '',
         'stav': 0},
        {'sender': 263861517,
         'balance': 1000,
         'is_true_sides': 0,
         'is_true_deaths': 0,
         'items': 0,
         'side': '',
         'stav': 0},
        {'sender': 447434376,
         'balance': 1000,
         'is_true_sides': 0,
         'is_true_deaths': 0,
         'items': 0,
         'side': '',
         'stav': 0},
        {'sender': 338010077,
         'balance': 1000,
         'is_true_sides': 0,
         'is_true_deaths': 0,
         'items': 0,
         'side': '',
         'stav': 0}
        ]
total = []
group = 210073314
totalize = 0
totalize_max = 0
totalize_side = 0
total_side = 'ТОТАЛИЗАТОР НА СТОРОНЫ:\n'

token = "8d5b1a0549cd3d9528bfeccce5db1d8672f8c256a46822defab1aa2d83e4e6a177505a23a58283710742c"
authorize = vk_api.VkApi(token=token)
longpoll = VkLongPoll(authorize)
getting_api = authorize.get_api()
upload = VkUpload(authorize)

for event in longpoll.listen():
    if event.type == VkEventType.MESSAGE_NEW and event.to_me and event.text:
        # admins = [605574836]
        admins = [313354983, 605574836, 263861517, 447434376, 338010077]
        received_message = event.text
        rm = received_message.lower()
        sender = event.user_id
        sayer_name = get_name(sender)
        try:
            player_balance = get_balance(sender)
            bal = get_bal(sender)
        except UnboundLocalError:
            bal = 0
            player_balance = ''

        if rm == "оформить заявку":
            for i in range(len(req)):
                sender_id = req[i - 1]['sender']
                if sender_id == sender:
                    req.pop(i - 1)
                    break
            req.append(dict(sender=sender))  # creating player's slot
            keyboard = VkKeyboard(inline=True)
            keyboard.add_button('Эви')
            keyboard.add_button('Черри')
            keyboard.add_button('Нат')
            keyboard.add_line()
            keyboard.add_button('Кирена')
            keyboard.add_button('Трики')
            send_button(sender, "🔪 [Шаг 1] Кто твой ведущий?")
        elif rm == "лавка роберто":
            keyboard = VkKeyboard(inline=True)
            keyboard.add_button('Магазин')
            keyboard.add_button('Ставка')
            keyboard.add_line()
            keyboard.add_button('Тотализатор')
            keyboard.add_button('Баланс')
            send_button(sender, "Над твоей головой раздаётся звон дверного колокольчика, когда ты с трудом толкаешь "
                                "входную дверь. Полутёмное помещение освещается мягким янтарным светом настенных "
                                "светильников, отражаясь в стеклянных витринах расставленных вдоль стен шкафов.\nВ "
                                "глубине помещения ты замечаешь прилавок и скучающего за ним мужчину, "
                                "перелистывающего страницы потрёпанной книги. Роберто замечает тебя, лишь когда ты "
                                "подходишь вплотную к прилавку, и поднимает на тебя ехидный взгляд.\n– Чем могу быть "
                                "полезен?")
        elif rm == 'ставка':
            keyboard = VkKeyboard(inline=True)
            keyboard.add_button('Cвeтлые')
            keyboard.add_line()
            keyboard.add_button('Tёмныe')
            keyboard.add_line()
            keyboard.add_button('Ceрые')
            message = f'Выбери сторону, которая, по твоему мнению, одержит победу в этом сезоне:'
            send_button(sender, message)
        elif rm == 'cвeтлые' or rm == 'tёмныe' or rm == 'ceрые':
            for i in range(len(shop)):
                if shop[i - 1]['sender'] == sender:
                    if shop[i - 1]['side'] == '' or shop[i - 1]['stav'] == 0:
                        rm1 = rm[:-1].capitalize()
                        message = f'Твой {player_balance} Укажи, сколько ты хочешь поставить на победу {rm1}х. Напиши ' \
                                  f'\"Ставка [количество делликов]\" (без кавычек). Например: Ставка 10 — для ставки ' \
                                  f'в 10 делликов.\n\nДумай осторожно, второго шанса поставить у тебя не будет! '
                        send_message(sender, message)
                        shop[i - 1]['side'] = rm.capitalize()
                    else:
                        send_message(sender, 'Больше ставку на победу стороны сделать нельзя! Надо было думать раньше!')
        elif rm[:7] == 'ставка ':
            rm = int(rm[7:])
            if bal >= rm:
                for i in range(len(shop)):
                    if shop[i - 1]['sender'] == sender:
                        if shop[i - 1]['side'] != '' and shop[i - 1]['stav'] == 0:
                            shop[i - 1]['balance'] -= rm
                            shop[i - 1]['stav'] = 1
                            side = shop[i - 1]['side']
                            print(side)
                            side = side[0:-1]
                            player_balance = get_balance(sender)
                            message = f'Твоя ставка на {side}х принята!\nТекущий {player_balance}'
                            send_message(sender, message)
                            for admin in admins:
                                ending = find_ending(rm)
                                side = shop[i - 1]['side']
                                mes = f'Новая ставка на победу\n{sayer_name} vk.com/id{sender}\n\nРазмер ' \
                                              f'ставки: {rm} деллик{ending}\nСторона: {side}'
                                send_message(admin, mes)
                        else:
                            send_message(sender, 'Больше ставить на победу стороны нельзя! Надо было думать раньше!')
        elif rm == 'стоп ставки':
            for j in range(len(admins)):
                if sender == admins[j]:
                    for i in range(len(shop)):
                        if shop[i - 1]['stav'] != 1:
                            shop[i - 1]['stav'] = 1
                            shop[i - 1]['side'] = 'рип'
                    send_message(sender, 'Ставки на победу стороны больше не принимаются.')
        elif rm == 'баланс':
            if player_balance[:6] == 'баланс':
                player_balance = 'Твой ' + player_balance
                send_message(sender, player_balance)
            else:
                shop.append(dict(sender=sender, balance=0, is_true_sides=0, is_true_deaths=0, items=0, side='', stav=0))  # creating player's slot
                send_message(sender, 'Поздравляю, у тебя появился кошелёк. Держи ухо востро: скоро там появятся '
                                     'деньги! Если они, конечно, у тебя были...')
                for admin in admins:
                    mes = f'Игрок {sayer_name} (id{sender}) создал кошелёк и хочет деняк'
                    send_message(admin, mes)
        elif rm[:2] == 'id':
            for j in range(len(admins)):
                if sender == admins[j]:
                    rm = rm[2:]
                    k = rm.split(' ')
                    if k[1] == 'предмет':
                        for i in range(len(shop)):
                            if shop[i - 1]['sender'] == int(k[0]):
                                if shop[i - 1]['items'] == 1:
                                    shop[i - 1]['items'] = 0
                                    send_message(sender, 'Игрок {} использовал свой предмет'.format(k[0]))
                                else:
                                    send_message(sender, 'У этого игрока нет предмета')
                    else:
                        try:
                            ending1 = find_ending(k[1])
                            for i in range(len(shop)):
                                if shop[i - 1]['sender'] == int(k[0]):
                                    shop[i - 1]['balance'] += int(k[1])
                                    player_balance = 'Текущий ' + get_balance(int(k[0]))
                                    message = f'Твой счёт пополнен на {k[1]} деллик{ending1}. {player_balance}'
                                    adm = f'Баланс игрока vk.com/id{k[0]} пополнен на {k[1]} деллик{ending1}'
                                    send_message(int(k[0]), message)
                                    send_message(sender, adm)
                                    send_message(313354983, adm)
                                    send_message(605574836, adm)
                        except IndexError:
                            send_message(sender, 'Ой... Будь осторожнее!')
        elif rm == 'магазин' or rm == 'вернуться к списку предметов':
            keyboard = VkKeyboard(inline=True)
            keyboard.add_button('Компромат')
            keyboard.add_button('Кукла Вуду')
            keyboard.add_line()
            keyboard.add_button('Бондаж', color=VkKeyboardColor.PRIMARY)
            keyboard.add_button('Прослушка', color=VkKeyboardColor.PRIMARY)
            keyboard.add_line()
            keyboard.add_button('Порча')
            keyboard.add_button('Амулет')
            keyboard.add_line()
            keyboard.add_button('Больше предметов', color=VkKeyboardColor.PRIMARY)
            player_balance = 'Твой ' + player_balance
            message = f'Приветствую в своей лавке, дружище! Покажи-ка свой кошелёк... Хм... {player_balance} Не густо. Ладно, смотри, что у меня есть:\n\nКомпромат (шт.): {afer}\nКукла Вуду (шт.): {voodoo}\nБондаж (шт.): {ropes}\nПрослушка (шт.): {bug}\nПорча (шт.): {curse}\nАмулет (шт.): {pure}\n\nЕсли это тебя не устроит, за твоей спиной есть ещё прилавок.'
            send_button(sender, message)
        elif rm == 'больше предметов':
            keyboard = VkKeyboard(inline=True)
            keyboard.add_button('Заказная статья')
            keyboard.add_line()
            keyboard.add_button('Бутылка водки', color=VkKeyboardColor.PRIMARY)
            keyboard.add_line()
            keyboard.add_button('Сыворотка правды')
            keyboard.add_line()
            keyboard.add_button('Звонок киллеру', color=VkKeyboardColor.PRIMARY)
            keyboard.add_line()
            keyboard.add_button('Вернуться к списку предметов')
            message = f'Да, вот тут. Можешь рассмотреть поближе:\n\nЗаказная статья (шт.): {jour}\nБутылка водки (шт.): {vodka}\nСыворотка правды (шт.): {truth}\nЗвонок киллеру (шт.): {kill}\n\nЧто-то брать будешь или просто постоим? '
            send_button(sender, message)
        elif rm == 'компромат' or rm == 'кукла вуду' or rm == 'бондаж' or rm == 'прослушка' or rm == 'порча' or rm == 'амулет' or rm == 'заказная статья' or rm == 'бутылка водки' or rm == 'сыворотка правды' or rm == 'звонок киллеру':
            keyboard = VkKeyboard(inline=True)
            keyboard.add_button('Вернуться к списку предметов')

            if rm == 'бутылка водки' and isinstance(vodka, str) is False:
                if bal >= 30:
                    keyboard.add_line()
                    keyboard.add_button('Kупить бутылку водки')
                buying1 = vodka1
            elif rm == 'компромат' and isinstance(afer, str) is False:
                if bal >= 30:
                    keyboard.add_line()
                    keyboard.add_button('Kупить компромат')
                buying1 = afer1
            elif rm == 'кукла вуду' and isinstance(voodoo, str) is False:
                if bal >= 30:
                    keyboard.add_line()
                    keyboard.add_button('Kупить куклу Вуду')
                buying1 = voodoo1
            elif rm == 'бондаж' and isinstance(ropes, str) is False:
                if bal >= 30:
                    keyboard.add_line()
                    keyboard.add_button('Kупить бондаж')
                buying1 = ropes1
            elif rm == 'прослушка' and isinstance(bug, str) is False:
                if bal >= 30:
                    keyboard.add_line()
                    keyboard.add_button('Kупить прослушку')
                buying1 = bug1
            elif rm == 'порча' and isinstance(curse, str) is False:
                if bal >= 30:
                    keyboard.add_line()
                    keyboard.add_button('Kупить порчу')
                buying1 = curse1
            elif rm == 'амулет' and isinstance(pure, str) is False:
                if bal >= 30:
                    keyboard.add_line()
                    keyboard.add_button('Kупить амулет')
                buying1 = pure1
            elif rm == 'заказная статья' and isinstance(jour, str) is False:
                if bal >= 30:
                    keyboard.add_line()
                    keyboard.add_button('Kупить заказную статью')
                buying1 = jour1
            elif rm == 'звонок киллеру' and isinstance(kill, str) is False:
                if bal >= 30:
                    keyboard.add_line()
                    keyboard.add_button('Kупить звонок киллеру')
                buying1 = kill1
            elif rm == 'сыворотка правды' and isinstance(truth, str) is False:
                if bal >= 30:
                    keyboard.add_line()
                    keyboard.add_button('Kупить сыворотку правды')
                buying1 = truth1

            send_button(sender, buying1)
        elif rm[:6] == 'kупить':
            hour = int(datetime.datetime.today().strftime('%H'))
            if hour == 16 or hour == 17 or hour == 22 or hour == 23:
                if bal >= 30:
                    for i in range(len(shop)):
                        if shop[i - 1]['sender'] == sender:
                            if shop[i - 1]['items'] == 0:
                                rm = rm[7:]
                                if rm == 'бутылку водки' and isinstance(vodka, str) is False:
                                    complete = buying(sender, vodka_end)
                                    vodka -= 1
                                    if vodka == 0:
                                        vodka = 'SOLD OUT'
                                if rm == 'компромат' and isinstance(afer, str) is False:
                                    complete = buying(sender, afer_end)
                                    afer -= 1
                                    if afer == 0:
                                        afer = 'SOLD OUT'
                                if rm == 'куклу вуду' and isinstance(voodoo, str) is False:
                                    complete = buying(sender, voodoo_end)
                                    voodoo -= 1
                                    if voodoo == 0:
                                        voodoo = 'SOLD OUT'
                                if rm == 'бондаж' and isinstance(ropes, str) is False:
                                    complete = buying(sender, ropes_end)
                                    ropes -= 1
                                    if ropes == 0:
                                        ropes = 'SOLD OUT'
                                if rm == 'прослушку' and isinstance(afer, str) is False:
                                    complete = buying(sender, bug_end)
                                    bug -= 1
                                    if bug == 0:
                                        bug = 'SOLD OUT'
                                if rm == 'порчу' and isinstance(curse, str) is False:
                                    complete = buying(sender, curse_end)
                                    curse -= 1
                                    if curse == 0:
                                        curse = 'SOLD OUT'
                                if rm == 'амулет' and isinstance(pure, str) is False:
                                    complete = buying(sender, pure_end)
                                    pure -= 1
                                    if pure == 0:
                                        pure = 'SOLD OUT'
                                if rm == 'заказную статью' and isinstance(jour, str) is False:
                                    complete = buying(sender, jour_end)
                                    jour -= 1
                                    if jour == 0:
                                        jour = 'SOLD OUT'
                                if rm == 'звонок киллеру' and isinstance(kill, str) is False:
                                    complete = buying(sender, kill_end)
                                    kill -= 1
                                    if kill == 0:
                                        kill = 'SOLD OUT'
                                if rm == 'сыворотку правды' and isinstance(truth, str) is False:
                                    complete = buying(sender, truth_end)
                                    truth -= 1
                                    if truth == 0:
                                        truth = 'SOLD OUT'

                                send_message(sender, complete)
                                for admin in admins:
                                    message = f'Новая покупка предмета\n{sayer_name} vk.com/id{sender}\n\nКупили: {rm}'
                                    send_message(admin, message)
                            else:
                                send_message(sender, 'У тебя уже есть предмет на руках! Сначала используй его, потом поговорим.')
                else:
                    send_message(sender, 'Ишь ты, чего хочешь! Иди денег сначала заработай!')
            else:
                send_message(sender, 'В данный момент магазин не работает. Попробуй позже.')
        elif rm[:13] == 'обнулить банк':
            rm = rm[14:]
            for i in range(len(admins)):
                if sender == admins[i]:
                    if rm == 'смертей':
                        totalize = 0
                        total = []
                        totalize_max = 0
                        for j in range(len(shop)):
                            shop[j - 1]['is_true_deaths'] = 0
                        send_message(sender, 'Банк тотализатора смертей обнулён. Мы готовы к новой фазе!')
                    elif rm == 'сторон':
                        totalize_side = 0
                        total_side = 'ТОТАЛИЗАТОР НА СТОРОНЫ:\n'
                        for j in range(len(shop)):
                            shop[j - 1]['is_true_sides'] = 0
                        send_message(sender, 'Банк тотализатора сторон обнулён. Мы готовы к новой фазе!')
        elif rm[:14] == 'обнулить людей':
            rm = rm[15:]
            for admin in admins:
                if sender == admin:
                    if rm == 'смерти':
                        total = []
                        totalize_max = 0
                        for i in range(len(shop)):
                            shop[i - 1]['is_true_deaths'] = 0
                        send_message(sender, 'Банк тотализатора смертей сохранён. Мы готовы к новой фазе!')
                    elif rm == 'стороны':
                        total_side = 'ТОТАЛИЗАТОР НА СТОРОНЫ:\n'
                        for i in range(len(shop)):
                            shop[i - 1]['is_true_sides'] = 0
                        send_message(sender, 'Банк тотализатора сторон сохранён. Мы готовы к новой фазе!')
        elif rm == 'ставки тотализатора':
            for k in range(len(admins)):
                if sender == admins[k]:
                    itogs = 'СПИСОК АЗАРТНЫХ ИГРОКОВ:\n\n'
                    print(total)
                    for i in range(totalize_max + 1):
                        for j in range(len(total)):
                            if total[j - 1][1] == i:
                                itogs += f'{i}: {total[j - 1][0]}\n'
                        itogs += '\n'
                    itogs += '\n' + total_side
                    send_message(sender, itogs)
        elif rm == 'тотализатор' or rm == 'количество смертей' or rm == 'стороны умерших' or rm[:6] == 'вангую' or rm == 'cветлые' or rm == 'cерые' or rm == 'tёмные' or rm == 'cветлые и тёмные' or rm == 'cерые и светлые' or rm == 'tёмные и серые' or rm == 'bсе стороны':
            hour = int(datetime.datetime.today().strftime('%H'))
            # minute = int(datetime.datetime.today().strftime('%M'))
            if hour == 22 or hour == 16:
                if rm == 'тотализатор':
                    keyboard = VkKeyboard(inline=True)
                    keyboard.add_button('Количество смертей')
                    keyboard.add_line()
                    keyboard.add_button('Стороны умерших', color=VkKeyboardColor.PRIMARY)
                    send_button(sender, 'На что ты хочешь поставить?')
                elif rm == 'стороны умерших':
                    keyboard = VkKeyboard(inline=True)
                    keyboard.add_button('Cветлые')
                    keyboard.add_button('Tёмные')
                    keyboard.add_line()
                    keyboard.add_button('Cерые', color=VkKeyboardColor.PRIMARY)
                    keyboard.add_line()
                    keyboard.add_button('Cветлые и тёмные')
                    keyboard.add_line()
                    keyboard.add_button('Cерые и светлые', color=VkKeyboardColor.PRIMARY)
                    keyboard.add_line()
                    keyboard.add_button('Tёмные и серые')
                    keyboard.add_line()
                    keyboard.add_button('Bсе стороны', color=VkKeyboardColor.PRIMARY)
                    send_button(sender, 'Выбери, кто сегодня потеряет игроков (стоимость ставки: 5 делликов):')
                elif rm == 'cветлые' or rm == 'cерые' or rm == 'tёмные' or rm == 'cветлые и тёмные' or rm == 'cерые и светлые' or rm == 'tёмные и серые' or rm == 'bсе стороны':
                    if bal - 5 >= 0:
                        for i in range(len(shop)):
                            if shop[i - 1]['sender'] == sender:
                                if shop[i - 1]['is_true_sides'] == 0:
                                    shop[i - 1]['balance'] -= 5
                                    player_balance = get_balance(sender)
                                    totalize_side += 5
                                    total_side += f'{sayer_name} — {rm.capitalize()}\n'
                                    send_message(sender, f'Твоя ставка: {rm.capitalize()} потеряют игрока. '
                                                         f'\nТекущий {player_balance}.\nСпасибо за участие '
                                                         f'и да пребудет с тобой удача! ')
                                    shop[i - 1]['is_true_sides'] = 1
                                    ending2 = find_ending(totalize_side)
                                    for admin in admins:
                                        mes = f'Новая ставка в тотализатор (стороны)\n{sayer_name} vk.com/id{sender}\n\nСторона: {rm.capitalize()}\nТекущий банк: {totalize_side} деллик{ending2} '
                                        send_message(admin, mes)
                                else:
                                    send_message(sender, 'Твоя ставка уже учтена! Приходи в следующий раз.')
                    else:
                        send_message(sender, 'На твоём счёте недостаточно делликов для участия.')
                elif rm == 'количество смертей':
                    message = f'Твой {player_balance} Напиши \"Вангую [число смертей] [' \
                              f'ставка в делликах]\", чтобы участвовать в тотализаторе на итоги. Пример: ' \
                              f'Вангую 3 10 — для ставки в размере 10 делликов на смерть 3 игроков.'
                    send_message(sender, message)
                elif rm[:6] == 'вангую':
                    rm = rm[7:]
                    try:
                        rm = rm.split(' ')
                    except IndexError:
                        send_message(sender, 'Ой! Что-то пошло не так...')
                    except ValueError:
                        send_message(sender, 'Ой! Что-то пошло не так...')
                    for i in range(len(shop)):
                        if shop[i - 1]['sender'] == sender:
                            if shop[i - 1]['is_true_deaths'] == 0:
                                ending1 = find_ending(rm[1])
                                if bal - int(rm[1]) >= 0 and int(rm[1]) > 0:
                                    shop[i - 1]['balance'] -= int(rm[1])
                                    totalize += int(rm[1])
                                    shop[i - 1]['is_true_deaths'] = 1
                                    total.append([sayer_name, int(rm[0])])
                                    if int(rm[1]) > totalize_max:
                                        totalize_max = int(rm[1])
                                    ending3 = find_ending(totalize)
                                    player_balance = get_balance(sender)
                                    message = f'Твоя ставка: {rm[1]} деллик{ending1}. Количество смертей: {rm[0]}.\n ' \
                                              f'Текущий {player_balance}\nСпасибо за участие и да ' \
                                              f'пребудет с тобой удача! '
                                    send_message(sender, message)
                                    for admin in admins:
                                        mes = f'Новая ставка в тотализатор (смерти)\n{sayer_name} vk.com/id{sender}\n\nРазмер ' \
                                              f'ставки: {rm[1]} деллик{ending1}\nКоличество смертей: {rm[0]}\n\n' \
                                              f'Текущий банк: {totalize} деллик{ending3} '
                                        send_message(admin, mes)
                                else:
                                    send_message(sender,
                                                 'На твоём счёте недостаточно делликов для участия. Попробуй '
                                                 'уменьшить ставку!')
                            elif shop[i - 1]['is_true_deaths'] == 1:
                                send_message(sender, 'Твоя ставка уже учтена! Приходи в следующий раз.')
            else:
                send_message(sender, 'Тотализатор пока не работает. Попробуй позже')
        else:
            for i in range(len(req)):
                sender_id = req[i - 1]['sender']
                if sender_id == sender:  # clarify if they're making a request
                    if rm == 'черри' or rm == 'эви' or rm == 'трики' or rm == 'кирена' or rm == 'нат':
                        req[i - 1]['host'] = rm.capitalize()
                        keyboard = VkKeyboard(inline=True)
                        keyboard.add_button('Активное действие')
                        keyboard.add_line()
                        keyboard.add_button('Распоряжение')
                        send_button(sender, "🔪 [Шаг 2] Что тебя интересует в этот раз?")
                    elif rm == 'активное действие':
                        req[i - 1]['type'] = 'Активное действие'
                        keyboard = VkKeyboard(inline=True)
                        keyboard.add_button('Ход роли')
                        keyboard.add_line()
                        keyboard.add_button('Активация контракта/предмета')
                        send_button(sender, "🔪 [Шаг 3] Какое действие ты хочешь совершить?")
                    elif rm == 'распоряжение':
                        req[i - 1]['type'] = 'Распоряжение на время отсутствия'
                        keyboard = VkKeyboard(inline=True)
                        keyboard.add_button('День')
                        keyboard.add_button('Ночь')
                        send_button(sender, '🔪 [Шаг 3] Уточни фазу, в которую ты будешь отсутствовать.')
                    elif rm[:4] == 'день' or rm[:4] == 'ночь':
                        req[i - 1]['phase'] = rm
                        send_message(sender,
                                     "🔪 [Шаг 4] На какой случай ты оставляешь распоряжение. \nОбязательно! Начни со "
                                     "слова \"Если\". Пример: если в меня будут стрелять. Если будут убивать "
                                     "члена моей команды. Если меня будут проверять и т.п.")
                    elif rm[:4] == 'если':
                        req[i - 1]['condition'] = rm
                        keyboard = VkKeyboard(inline=True)
                        keyboard.add_button('Ход роли')
                        keyboard.add_line()
                        keyboard.add_button('Активация контракта/предмета')
                        send_button(sender, "🔪 [Шаг 5] Какое действие нужно исполнить?")
                    elif rm == 'ход роли':
                        req[i - 1]['activity'] = rm
                        if req[i - 1]['type'] == 'Активное действие':
                            a = 4
                        else:
                            a = 6
                        send_message(sender,
                                     '🔪 [Шаг {}] Уточни свою роль.\nОбязательно! Начни со слова \"Роль\". Пример: \"Роль '
                                     'дон\", \"Роль журналист\" и т.п.'.format(a))
                    elif rm == 'активация контракта/предмета':
                        req[i - 1]['activity'] = rm
                        if req[i - 1]['type'] == 'Активное действие':
                            a = 4
                        else:
                            a = 6
                        send_message(sender, '🔪 [Шаг {}] Уточни используемый контракт/предмет.\nОбязательно! Начни со слова '
                                             '\"Контракт\"/\"Предмет\". Пример: \"Контракт иммунитет\", \"Предмет прослушка\" и т.п.'.format(
                            a))
                    elif rm[:4] == 'роль' or rm[:8] == 'контракт' or rm[:7] == 'предмет':
                        req[i - 1]['item'] = rm
                        if req[i - 1]['type'] == 'Активное действие':
                            a = 5
                        else:
                            a = 8
                        send_message(sender,
                                     '🔪 [Шаг {}] На кого направлено твоё действие? Необходимо указать ссылку на '
                                     'страницу выбранного игрока (в формате https://vk.com/id) и его имя. '
                                     '\nПример: https://vk.com/nastya_vorobushek Кирена\nЕсли тебе нужно '
                                     'указать двух игроков, также указывай сначала ссылки: '
                                     'https://vk.com/nastya_vorobushek с Кирены https://vk.com/cherrss на '
                                     'Черри\nЕсли ты хочешь сходить на себя, так и напиши: На себя. Указывать '
                                     'на себя ссылку не нужно.\nЕсли ты используешь рацию, то напиши, на какую роль '
                                     'ты её используешь. Пример: На революционера. На шпиона'.format(a))
                    elif rm[:15] == 'https://vk.com/' or rm[:3] == 'на ':
                        req[i - 1]['victim'] = received_message
                        type_of = req[i - 1]['type'].capitalize()
                        activity = req[i - 1]['activity'].capitalize()
                        if req[i - 1]['item'][:4] == 'роль':
                            item1 = 'Роль'
                            item1_1 = 'роли'
                            item2 = req[i - 1]['item'][5:].capitalize()
                        else:
                            item1 = 'Контракт/предмет'
                            item1_1 = 'контракта/предмета'
                            item2 = req[i - 1]['item'][8:].capitalize()
                        victim = req[i - 1]['victim']
                        host = req[i - 1]['host']
                        try:
                            phase = req[i - 1]['phase'].capitalize()
                            condition = req[i - 1]['condition'].capitalize()
                        except KeyError:
                            phase, condition = '', ''

                        if phase != '':
                            send_message(sender, "Поздравляю, твоя заявка отправлена на рассмотрение! Твой ведущий "
                                                 "напишет тебе, как только она будет принята. Напомню, "
                                                 "что ты совершаешь следующее: \n\n{} — {}\nВремя отсутствия: {}\n"
                                                 "Условие исполнения: {}\nИсполнить: Действие {} {}\nНа кого: {}".format(
                                type_of, activity, phase, condition, item1_1, item2, victim))
                            for admin in admins:
                                send_message(admin, "Новая заявка (распоряжение на время отсутствия)\n{} vk.com/id{} "
                                                    "\nДиалог: vk.com/gim{}?sel={}\n\n "
                                                    "Ведущий: {}\n\nВремя отсутствия: {}\n\nУсловие исполнения: "
                                                    "{}\n\nДействие: {}\n\n{}: {}\n\nНа кого: {}".format(
                                    sayer_name, sender, group, sender, host, phase, condition, activity, item1, item2,
                                    victim))
                        else:
                            send_message(sender, "Поздравляю, твоя заявка отправлена на рассмотрение! Твой ведущий "
                                                 "напишет тебе, как только она будет принята. Напомню, что ты "
                                                 "совершаешь следующее: \n\n{} — {}\nИсполнить: Действие {} {}\nНа кого: {}".format(
                                type_of, activity, item1_1, item2, victim))
                            for admin in admins:
                                send_message(admin, "Новая заявка\n{} vk.com/id{}\nДиалог: "
                                                    "vk.com/gim{}?sel={}\n\nВедущий: {}\n\nДействие: {}\n\n"
                                                    "{}: {}\n\nНа кого: {}".format(
                                    sayer_name, sender, group, sender, host, activity, item1, item2, victim))
                        req.pop(i - 1)
                    break