intro = "Ты выходишь из чулана, и дверь за тобой закрывается сама собой. У тебя была всего одна попытка выбрать. " \
        "Надеюсь, ты знаешь, что делаешь...\n\n➤Контракт: "
kill1 = "Убийство\nФаза активации: любая\nДействие контракта: ты заключишь контракт с " \
        "синьором Бесом, и единоразово он уберёт с твоей дороги одного твоего врага.\nДополнительно: активируется в " \
        "текущую фазу на любого игрока. "
heal1 = "Исцеление\nФаза активации: ночная\nДействие контракта: ты заключишь контракт с " \
        "донной Тарой, и единоразово в трансплантологической клинике тебе, или игроку по твоему выбору, осуществят " \
        "пересадку из подпольного банка органов.\nДополнительно: можно использовать как на себя, так и на другого " \
        "игрока. Активируется только в ночную фазу, можно оставить распоряжение на активацию в следующую с указанием " \
        "точных условий активации. "
find1 = "Раскрытие роли\nФаза активации: любая\nДействие контракта: ты заключишь контракт с " \
        "доном Алом, и единоразово он раскроет тебе роль человека, на которого ты укажешь.\nДополнительно: при " \
        "сообщении результата держателю контракта, действия роли Миледи не учитываются. Активируется в текущую фазу, " \
        "результат приходит после окончания фазы, но до итогов (день – 16:00, ночь – 22:00). "
close1 = "Подмена роли\nФаза активации: любая\nДействие контракта: ты заключишь контракт к " \
         "синьором Рабастаном, и единоразово он подменит ваше досье в случае проверки.\nДополнительно: можно " \
         "использовать как на себя, так и на другого игрока. При активации контракта вы заблаговременно указываете " \
         "желаемую роль. Именно она будет сообщаться игроку, решившему вас проверить. В случае проверки Шерифа или " \
         "Дона результатом проверки будет сторона выбранной вами роли "
immune1 = "Иммунитет\nФаза активации: дневная\nДействие контракта: ты заключишь контракт с " \
          "синьориной Кэнди, и единоразово синьорина Кэнди подарит тебе экскурсию по своему заведению. Это время ты " \
          "проведёшь безопасно… и сладко.\nДополнительно: можно использовать как на себя, так и на другого игрока. " \
          "Активируется только в дневную фазу. При активации контракта вы, или другой игрок, на которого вы " \
          "активируете контракт, будете под защитой от любого воздействия – лечение, убийство, проверка, и так далее, " \
          "но, если у вас активная дневная роль и фаза активации совпала с ходом вашей роли, вы также не сможете " \
          "совершать каких-либо действий. Контракт лишает вас права голоса на дневном голосовании. "
whisky1 = "Бутылка виски\nФаза активации: ночная\nДействие контракта: ты заключишь контракт с синьориной Эви, " \
          "и единоразово она устроит тебе персональный алкотур по самым крутым барам Бергамо.\nДополнительно: " \
          "активируется только на другого игрока в ночную фазу. На следующий день выбранный игрок не сможет " \
          "голосовать, а так же общаться в игровых беседах и альянсах. Если у выбранного игрока активная дневная " \
          "роль, он также не сможет совершить свой ход. "
ropes1 = "Бондаж\nФаза активации: любая\nДействие " \
         "контракта: ты заключишь контракт с синьором Элиасом, и единоразово он покажет тебе на практике все прелести " \
         "элитного БДСМ клуба.\nДополнительно: активируется в любую фазу, но только на другого игрока. Если фаза " \
         "активации совпадает с ходом активной роли игрока, он не сможет совершить каких-либо действий. Не лишает " \
         "выбранного игрока права голоса, если активирован ночью. В случае активации в дневную фазу, выбранный игрок " \
         "лишается права голоса. "
detect1 = "Частное расследование\nФаза активации: дневная\nДействие контракта: ты заключишь контракт с синьориной " \
          "Трики, и единоразово она позволит тебе " \
          "выпустить дополнительную статью журналиста.\nДополнительно: активируется в дневную фазу (до 16.00) на " \
          "любых игроков, кроме себя и тех, кто уже был упомянут в основных статьях журналиста. "
seek1 = "Слежка\nФаза активации: любая\nДействие " \
        "контракта: ты заключишь контракт с синьором Джо и синьориной Черри, и единоразово они устроят " \
        "профессиональную слежку за игроком, на которого ты укажешь.\nДополнительно: Сообщается только первое " \
        "совершённое за фазу игроком действие, будь оно действием роли или контракта. Активируется в текущую фазу, " \
        "результат приходит после окончания фазы, но до итогов (день – после 16:00, ночь – после 22:00). "
rumour1 = "Афера\nФаза активации: ночная\nДействие " \
          "контракта: ты заключишь контракт с синьором Антоном, и единоразово он распустит возмутительные сплетни о " \
          "том, на кого ты укажешь.\nДополнительно: выбирается два игрока — тот, который будет аргументировать, " \
          "и тот, против которого будут аргументировать в следующую дневную фазу. Жертва контракта не имеет права " \
          "говорить остальным игрокам о том, что она попала под влияние контракта, а также отмалчиваться на " \
          "обсуждении и быть неубедительным в своей аргументации. "
vote1 = "Дополнительные голоса\nФаза активации: дневная\nДействие контракта: ты заключишь контракт с синьором " \
        "Питером, и единоразово он внесёт правки в листы " \
        "голосования, добавив шесть голосов к твоему голосу.\nДополнительно: голоса можно активировать только на того " \
        "игрока, против которого вы голосовали. "
curse1 = "Проклятие\nФаза активации: любая\nДействие контракта: ты заключишь контракт с синьором Тропой, " \
         "и единоразово он нашлёт проклятие на " \
         "того, кто перешёл тебе дорогу.\nДополнительно: проклятый игрок умирает вместе с Ведьмой. О проклятии игроку " \
         "не сообщается. "
pure1 = "Очищение\nФаза активации: любая\nДействие " \
        "контракта: ты заключишь контракт с синьориной Киреной, и единоразово она снимет с выбранного тобой игрока " \
        "порчу и проклятье, воспользовавшись фамильным заклинанием, доставшимся ей от " \
        "бабушки-ведуньи.\nДополнительно: выбранный игрок наделяется иммунитетом как от уже наложенного проклятия, " \
        "так и от возможности быть проклятым. "

kill3 = ['photo-205080022_457239021']
whisky3 = ['photo-205080022_457239020']
find3 = ['photo-205080022_457239022']
heal3 = ['photo-205080022_457239023']
ropes3 = ['photo-205080022_457239024']
detect3 = ['photo-205080022_457239025']
close3 = ['photo-205080022_457239027']
immune3 = ['photo-205080022_457239028']
seek3 = ['photo-205080022_457239029']
rumour3 = ['photo-205080022_457239030']
vote3 = ['photo-205080022_457239026']
curse3 = ['photo-205080022_457239031']
pure3 = ['photo-205080022_457239032']

import vk_api
from vk_api.longpoll import VkLongPoll, VkEventType
from vk_api.utils import get_random_id
from vk_api.bot_longpoll import VkBotLongPoll, VkBotEventType
from vk_api import VkUpload
from vk_api.keyboard import VkKeyboard, VkKeyboardColor


def send_message(sender, message):
    authorize.method('messages.send', {'user_id': sender, 'message': message, 'random_id': get_random_id()})


def send_button(sender, message):
    authorize.method('messages.send', {'user_id': sender, 'message': message, 'random_id': get_random_id(),
                                       'keyboard': keyboard.get_keyboard()})


def send_sticker(sender, sticker):
    authorize.method('messages.send', {'user_id': sender, 'sticker_id': sticker, 'random_id': get_random_id()})


def get_name(sayer_id):
    sender_info = getting_api.users.get(user_ids=sayer_id)[0]
    full_name = sender_info.get('first_name') + ' ' + sender_info['last_name']
    return full_name


def deal(sender, attachment, message):
    authorize.method('messages.send',
                     {'user_id': sender, 'message': message, 'attachment': attachment,  # ','.join(attachment),
                      'random_id': get_random_id()})


def runout(sender):
    send_message(sender, "Слишком долго думаешь! Выбранный тобой предмет растворяется в воздухе прямо перед твоими "
                         "глазами. Может, стоит взять что-то другое?")


def giveaway(obj, obj1, obj3):
    obj.append(sayer_name)
    ids.append(sender)
    attachments = []
    attachments.append(obj3)
    obj1 = intro + obj1
    deal(sender, obj3, obj1)


def finally_end():
    itog = "Распределение контрактов:"
    itog += "\n\nИММУНИТЕТ:\n"
    for j in range(len(immune)):
        itog += immune[j] + "\n"
        j += 1
    itog += "\n\nУБИЙСТВО:\n"
    for j in range(len(kill)):
        itog += kill[j] + "\n"
        j += 1
    itog += "\n\nИСЦЕЛЕНИЕ:\n"
    for j in range(len(heal)):
        itog += heal[j] + "\n"
        j += 1
    itog += "\n\nРАСКРЫТИЕ РОЛИ:\n"
    for j in range(len(find)):
        itog += find[j] + "\n"
        j += 1
    itog += "\n\nПОДМЕНА РОЛИ:\n"
    for j in range(len(close)):
        itog += close[j] + "\n"
        j += 1
    itog += "\n\nБУТЫЛКА ВИСКИ:\n"
    for j in range(len(whisky)):
        itog += whisky[j] + "\n"
        j += 1
    itog += "\n\nБОНДАЖ:\n"
    for j in range(len(ropes)):
        itog += ropes[j] + "\n"
        j += 1
    itog += "\n\nЧАСТНОЕ РАССЛЕДОВАНИЕ:\n"
    for j in range(len(detect)):
        itog += detect[j] + "\n"
        j += 1
    itog += "\n\nСЛЕЖКА:\n"
    for j in range(len(seek)):
        itog += seek[j] + "\n"
        j += 1
    itog += "\n\nАФЕРА:\n"
    for j in range(len(rumour)):
        itog += rumour[j] + "\n"
        j += 1
    itog += "\n\nГОЛОСА:\n"
    for j in range(len(vote)):
        itog += vote[j] + "\n"
        j += 1
    itog += "\n\nПРОКЛЯТИЕ:\n"
    for j in range(len(curse)):
        itog += curse[j] + "\n"
        j += 1
    itog += "\n\nОЧИЩЕНИЕ:\n"
    for j in range(len(pure)):
        itog += pure[j] + "\n"
        j += 1
    return itog


people = []
req = []
group = 208174923
au = 0

token = "c8e52feefd22e9a472f7631e33950b7c57ea4de61c6ecaa0707d03fa223aa799ee3c8aa0f2f9653f32cab"
authorize = vk_api.VkApi(token=token)
longpoll = VkLongPoll(authorize)
getting_api = authorize.get_api()
upload = VkUpload(authorize)

for event in longpoll.listen():
    if event.type == VkEventType.MESSAGE_NEW and event.to_me and event.text:
        # admins = [605574836]
        admins = [605574836, 572147366, 252868342, 338010077, 313354983, 471824402, 263861517]
        received_message = event.text
        rm = received_message.lower()
        sender = event.user_id
        sayer_name = get_name(sender)

        if rm == "аукцион":
            i = 0
            for i in range(len(admins)):
                if sender == admins[i]:
                    au = 1
                    kill0 = 6
                    heal0 = 6
                    find0 = 6
                    close0 = 6
                    immune0 = 4
                    whisky0 = 2
                    ropes0 = 2
                    detect0 = 2
                    seek0 = 2
                    rumour0 = 2
                    vote0 = 3
                    pure0 = 1
                    curse0 = 1

                    kill = []
                    heal = []
                    find = []
                    close = []
                    immune = []
                    whisky = []
                    ropes = []
                    detect = []
                    seek = []
                    rumour = []
                    vote = []
                    pure = []
                    curse = []

                    people = []
                    ids = []

                    count = 0
                    for j in range(len(admins)):
                        send_message(admins[j], "Да будет аукцион!")
                        j += 1
                    break
                elif sender != admins[i]:
                    i += 1
        elif (rm == "хочу контракт" or rm == "к началу") and au == 1:
            keyboard = VkKeyboard(inline=True)
            keyboard.add_button('Иммунитет – взять',
                                color=VkKeyboardColor.PRIMARY)  # POSITIVE зелёный, NEGATIVE красный, PRIMARY синий
            keyboard.add_button('Исцеление – взять', color=VkKeyboardColor.PRIMARY)
            keyboard.add_line()
            keyboard.add_button('Дополнительные голоса – взять')
            keyboard.add_button('Слежка – взять')
            keyboard.add_line()
            keyboard.add_button('Частное расследование – взять', color=VkKeyboardColor.PRIMARY)
            keyboard.add_button('Убийство – взять', color=VkKeyboardColor.PRIMARY)
            keyboard.add_line()
            keyboard.add_button('Больше контрактов', color=VkKeyboardColor.PRIMARY)
            send_button(sender, "Странное место... Ты идёшь по длинному винтажному коридору, и твом шаги эхом "
                                "отзываются в его пустоте. Где же все? Вдруг твоё внимание привлекает приоткрытая "
                                "дверь чулана, из-за которой мерцает тусклый свет. Ты решаешь зайти туда и видишь, "
                                "что на столе разложены предметы. Может, стоит взять один? Но только один, "
                                "иначе тебя заметят!")
        elif rm == "список" and au == 1:
            for i in range(len(admins)):
                if sender == admins[i]:
                    itog = finally_end()
                    send_message(sender, itog)
                else:
                    i += 1
        elif rm == "больше контрактов" and au == 1:
            keyboard = VkKeyboard(inline=True)
            keyboard.add_button('Бондаж – взять', color=VkKeyboardColor.PRIMARY)
            keyboard.add_button('Афера – взять', color=VkKeyboardColor.PRIMARY)
            keyboard.add_line()
            keyboard.add_button('Раскрытие роли – взять')
            keyboard.add_button('Подмена роли – взять')
            keyboard.add_line()
            keyboard.add_button('Проклятие – взять', color=VkKeyboardColor.PRIMARY)
            keyboard.add_button('Очищение – взять', color=VkKeyboardColor.PRIMARY)
            keyboard.add_line()
            keyboard.add_button('Бутылка виски – взять', color=VkKeyboardColor.PRIMARY)
            keyboard.add_button('К началу', color=VkKeyboardColor.PRIMARY)
            send_button(sender, "Обернувшись, ты видишь, что на стене висят другие вещи:")
        elif rm[-7:] == "– взять" and au == 1:
            false = 0
            k = 0
            for k in range(len(ids)):
                if sender == ids[k]:
                    send_message(sender,
                                 "Двери чулана больше не поддаются: кажется, теперь они навсегда закрыты для тебя...")
                    false = 1
                    break
                else:
                    k += 1
            if false != 1:
                rm = rm[:-8]
                if rm == "иммунитет":
                    if immune0 == 0:
                        runout(sender)
                    else:
                        giveaway(immune, immune1, immune3)
                        count += 1
                        immune0 -= 1
                elif rm == "слежка":
                    if seek0 == 0:
                        runout(sender)
                    else:
                        giveaway(seek, seek1, seek3)
                        count += 1
                        seek0 -= 1
                elif rm == "убийство":
                    if kill0 == 0:
                        runout(sender)
                    else:
                        giveaway(kill, kill1, kill3)
                        count += 1
                        kill0 -= 1
                elif rm == "исцеление":
                    if heal0 == 0:
                        runout(sender)
                    else:
                        giveaway(heal, heal1, heal3)
                        count += 1
                        heal0 -= 1
                elif rm == "бутылка виски":
                    if whisky0 == 0:
                        runout(sender)
                    else:
                        giveaway(whisky, whisky1, whisky3)
                        count += 1
                        whisky0 -= 1
                elif rm == "бондаж":
                    if ropes0 == 0:
                        runout(sender)
                    else:
                        giveaway(ropes, ropes1, ropes3)
                        count += 1
                        ropes0 -= 1
                elif rm == "частное расследование":
                    if detect0 == 0:
                        runout(sender)
                    else:
                        giveaway(detect, detect1, detect3)
                        count += 1
                        detect0 -= 1
                elif rm == "афера":
                    if rumour0 == 0:
                        runout(sender)
                    else:
                        giveaway(rumour, rumour1, rumour3)
                        count += 1
                        rumour0 -= 1
                elif rm == "раскрытие роли":
                    if find0 == 0:
                        runout(sender)
                    else:
                        giveaway(find, find1, find3)
                        count += 1
                        find0 -= 1
                elif rm == "подмена роли":
                    if close0 == 0:
                        runout(sender)
                    else:
                        giveaway(close, close1, close3)
                        count += 1
                        close0 -= 1
                elif rm == "проклятие":
                    if curse0 == 0:
                        runout(sender)
                    else:
                        giveaway(curse, curse1, curse3)
                        count += 1
                        curse0 -= 1
                elif rm == "дополнительные голоса":
                    if vote0 == 0:
                        runout(sender)
                    else:
                        giveaway(vote, vote1, vote3)
                        count += 1
                        vote0 -= 1
                elif rm == "очищение":
                    if pure0 == 0:
                        runout(sender)
                    else:
                        giveaway(pure, pure1, pure3)
                        count += 1
                        pure0 -= 1
                else:
                    send_message(sender, "Что-что?")
                if count == 43:
                    itog = finally_end()
                    for i in range(len(admins)):
                        send_message(admins[i], itog)
                        i += 1
        elif rm == "оформить заявку":
            for i in range(len(req)):
                sender_id = req[i - 1]['sender']
                if sender_id == sender:
                    req.pop(i - 1)
                    break
            req.append(dict(sender=sender))  # creating player's slot
            keyboard = VkKeyboard(inline=True)
            keyboard.add_button('Черри')
            keyboard.add_button('Джо')
            keyboard.add_button('Кирена')
            keyboard.add_line()
            keyboard.add_button('Тропа')
            keyboard.add_button('Фости')
            keyboard.add_button('Трики')
            send_button(sender, "🎃 [Шаг 1] Кто твой ведущий?")
        elif rm == 'где тыква?':
            send_sticker(sender, 51852)
        else:
            for i in range(len(req)):
                sender_id = req[i - 1]['sender']
                if sender_id == sender:  # clarify if they're making a request
                    if rm == 'черри' or rm == 'джо' or rm == 'кирена' or rm == 'тропа' or rm == 'фости' or rm == 'трики':
                        req[i - 1]['host'] = rm.capitalize()
                        keyboard = VkKeyboard(inline=True)
                        keyboard.add_button('Активное действие')
                        keyboard.add_line()
                        keyboard.add_button('Распоряжение')
                        send_button(sender, "🎃 [Шаг 2] Что тебя интересует в этот раз?")
                    elif rm == 'активное действие':
                        req[i - 1]['type'] = 'Активное действие'
                        keyboard = VkKeyboard(inline=True)
                        keyboard.add_button('Ход роли')
                        keyboard.add_line()
                        keyboard.add_button('Активация контракта')
                        send_button(sender, "🎃 [Шаг 3] Какое действие ты хочешь совершить?")
                    elif rm == 'распоряжение':
                        req[i - 1]['type'] = 'Распоряжение на время отсутствия'
                        keyboard = VkKeyboard(inline=True)
                        keyboard.add_button('День')
                        keyboard.add_button('Ночь')
                        send_button(sender, '🎃 [Шаг 3] Уточни фазу, в которую ты будешь отсутствовать.')
                    elif rm[:4] == 'день' or rm[:4] == 'ночь':
                        req[i - 1]['phase'] = rm
                        send_message(sender,
                                     "🎃 [Шаг 4] На какой случай ты оставляешь распоряжение. \nОбязательно! Начни со "
                                     "слова \"Если\". Пример: если в меня будут стрелять. Если будут убивать "
                                     "члена моей команды. Если меня будут проверять и т.п.")
                    elif rm[:4] == 'если':
                        req[i - 1]['condition'] = rm
                        keyboard = VkKeyboard(inline=True)
                        keyboard.add_button('Ход роли')
                        keyboard.add_line()
                        keyboard.add_button('Активация контракта')
                        send_button(sender, "🎃 [Шаг 5] Какое действие нужно исполнить?")
                    elif rm == 'ход роли':
                        req[i - 1]['activity'] = rm
                        if req[i - 1]['type'] == 'Активное действие':
                            a = 4
                        else:
                            a = 6
                        send_message(sender,
                                     '🎃 [Шаг {}] Уточни свою роль.\nОбязательно! Начни со слова \"Роль\". Пример: \"Роль '
                                     'дон\", \"Роль журналист\" и т.п.'.format(a))
                    elif rm == 'активация контракта':
                        req[i - 1]['activity'] = rm
                        if req[i - 1]['type'] == 'Активное действие':
                            a = 4
                        else:
                            a = 6
                        send_message(sender, '🎃 [Шаг {}] Уточни используемый контракт.\nОбязательно! Начни со слова '
                                             '\"Контракт\". Пример: \"Контракт иммунитет\", \"Контракт слежка\" и т.п.'.format(
                            a))
                    elif rm[:4] == 'роль' or rm[:8] == 'контракт':
                        req[i - 1]['item'] = rm
                        if req[i - 1]['type'] == 'Активное действие':
                            a = 5
                        else:
                            a = 8
                        send_message(sender,
                                     '🎃 [Шаг {}] На кого направлено твоё действие? Необходимо указать ссылку на '
                                     'страницу выбранного игрока (в формате https://vk.com/id) и его имя. '
                                     '\nПример: https://vk.com/nastya_vorobushek Кирена\nЕсли тебе нужно '
                                     'указать двух игроков, также указывай сначала ссылки: '
                                     'https://vk.com/nastya_vorobushek с Кирены https://vk.com/cherrss на '
                                     'Черри\nЕсли ты хочешь сходить на себя, так и напиши: На себя. Указывать '
                                     'на себя ссылку не нужно.'.format(a))
                    elif rm[:15] == 'https://vk.com/' or rm == 'на себя':
                        req[i - 1]['victim'] = received_message
                        type_of = req[i - 1]['type'].capitalize()
                        activity = req[i - 1]['activity'].capitalize()
                        if req[i - 1]['item'][:4] == 'роль':
                            item1 = 'Роль'
                            item1_1 = 'роли'
                            item2 = req[i - 1]['item'][5:].capitalize()
                        else:
                            item1 = 'Контракт'
                            item1_1 = 'контракта'
                            item2 = req[i - 1]['item'][9:].capitalize()
                        victim = req[i - 1]['victim']
                        host = req[i - 1]['host']
                        try:
                            phase = req[i - 1]['phase'].capitalize()
                            condition = req[i - 1]['condition'].capitalize()
                        except KeyError:
                            phase, condition = '', ''

                        if phase != '':
                            send_message(sender, "Поздравляю, твоя заявка отправлена на рассмотрение! Твой ведущий "
                                                 "напишет тебе, как только она будет принята. Напомню, "
                                                 "что ты совершаешь следующее: \n\n{} — {}\nВремя отсутствия: {}\n"
                                                 "Условие исполнения: {}\nИсполнить: Действие {} {}\nНа кого: {}".format(
                                type_of, activity, phase, condition, item1_1, item2, victim))
                            for admin in admins:
                                send_message(admin, "Новая заявка (распоряжение на время отсутствия)\n{} vk.com/id{} "
                                                    "\nДиалог: vk.com/gim{}?sel={}\n\n "
                                                    "Ведущий: {}\n\nВремя отсутствия: {}\n\nУсловие исполнения: "
                                                    "{}\n\nДействие: {}\n\n{}: {}\n\nНа кого: {}".format(
                                    sayer_name, sender, group, sender, host, phase, condition, activity, item1, item2,
                                    victim))
                        else:
                            send_message(sender, "Поздравляю, твоя заявка отправлена на рассмотрение! Твой ведущий "
                                                 "напишет тебе, как только она будет принята. Напомню, что ты "
                                                 "совершаешь следующее: \n\n{} — {}\nИсполнить: Действие {} {}\nНа кого: {}".format(
                                type_of, activity, item1_1, item2, victim))
                            for admin in admins:
                                send_message(admin, "Новая заявка\n{} vk.com/id{}\nДиалог: "
                                                    "vk.com/gim{}?sel={}\n\nВедущий: {}\n\nДействие: {}\n\n"
                                                    "{}: {}\n\nНа кого: {}".format(
                                    sayer_name, sender, group, sender, host, activity, item1, item2, victim))
                        req.pop(i - 1)
                    break
